iarsystems/ewarm-nxp-example-projects/LPC_CDL/software/csps/lpc23xx/source/lpc23xx_uart_driver.c
/***********************************************************************
* $Id: lpc23xx_uart_driver.c 28 2014-01-27 14:45:13Z danielru $
*
* Project: LPC23xx UART driver
*
* Description:
*     This file contains the structure definitions and manifest
*     constants for the LPC23xx chip family component: UART
*
***********************************************************************
* Software that is described herein is for illustrative purposes only
* which provides customers with programming information regarding the
* products. This software is supplied "AS IS" without any warranties.
* NXP Semiconductors assumes no responsibility or liability for the
* use of the software, conveys no license or title under any patent,
* copyright, or mask work right to the product. NXP Semiconductors
* reserves the right to make changes in the software without
* notification. NXP Semiconductors also make no representation or
* warranty that such application will be suitable for the specified
* use without further testing or modification.
**********************************************************************/
#include "arm7tdmis_types.h"
#include "lpc23xx_uart_driver.h"
#include "lpc23xx_vic_driver.h"
#include "lpc23xx_scb_driver.h"
#include "lpc23xx_pinsel_driver.h"

/***********************************************************************
 * Private UART driver data and types
 **********************************************************************/
/* UART baudrate parameter for register structure type */
typedef struct
{
    U32 Udlm;		/* divisor latch MSB */
    U32 Udll;		/* divisor latch LSB */
    U32 Umul;		/* Fractional Divider multiple value */
    U32 Udiv;		/* Fractional Divider divider value */
} UART_BAUDREGS_VAL_T;

/* UART Ring buffer structure */
typedef struct
{
    U8  tx[UART_RING_BUFSIZE];  /* UART Tx data ring buffer */
    U8  rx[UART_RING_BUFSIZE];  /* UART Rx data ring buffer */
    S32 tx_head;                /* UART Tx ring buffer head index */
    S32 tx_tail;                /* UART Tx ring buffer tail index */
    S32 rx_head;                /* UART Rx ring buffer head index */
    S32 rx_tail;                /* UART Rx ring buffer tail index */
} UART_RING_BUFFER_T;

/* UART device configuration structure type */
typedef struct
{
    BOOL32 init;          	/* Device initialized flag */
    UART_RING_BUFFER_T rb; 	/* Device ring buffer */
    UART_Type *regptr;   	/* Pointer to UART registers */
} UART_CFG_T;

/* UART device configuration structure for UART 0 */
#if UART_0_ENABLE == 1
STATIC UART_CFG_T uart0cfg;
#endif

/* UART device configuration structure for UART 1 */
#if UART_1_ENABLE == 1
STATIC UART_CFG_T uart1cfg;
#endif

/**********************************************************************
 * UART driver private functions
 *********************************************************************/

/**********************************************************************
 * Function: uart_standard_receive
 * Purpose: Common UART receive function
 * Parameter:
 * 		uartcfg: pointer to UART configuration structure
 * Return: 
 * 		None
 *********************************************************************/
STATIC void uart_standard_receive(UART_CFG_T *uartcfg)
{
    UART_Type *uartregs = uartcfg->regptr;
    /* Continue stuffing the receive ring FIFO until the receive FIFO
       is empty - RDR bit = 0 */
    while (uartregs->LSR & UART_LSR_RDR)
    {
        uartcfg->rb.rx[uartcfg->rb.rx_head] =
            (U8) (uartregs->RBTHDLR & UART_DATA_MASK);

        /* Increment receive ring buffer head pointer */
        uartcfg->rb.rx_head++;
        if (uartcfg->rb.rx_head >= UART_RING_BUFSIZE)
        {
            uartcfg->rb.rx_head = 0;
        }
    }
}

/**********************************************************************
 * Function: uart_standard_transmit
 * Purpose: Common UART transmit function
 * Parameter:
 * 		uartcfg: pointer to UART configuration structure
 * Return: 
 * 		None
 *********************************************************************/
STATIC void uart_standard_transmit(UART_CFG_T *uartcfg)
{
    U32 FIFO_buff_size = 16; /* reserve for FIFO mode */
	UART_Type *uartregs = uartcfg->regptr;
	
	/* Wait for FIFO buffer empty, transfer 16 bytes of data or 
	 break whenever ring buffers are empty*/
	/* Wait until THR empty */
	while (!(uartregs->LSR & UART_LSR_THRE));

    while ((uartcfg->rb.tx_head != uartcfg->rb.tx_tail)
        && (FIFO_buff_size > 0))
    {
        /* Move a piece of data into the transmit FIFO */
    	/* HieuNguyen: Note U32 */
        uartregs->RBTHDLR = uartcfg->rb.tx[uartcfg->rb.tx_tail];
        
        /* Update FIFO_buff_size */
        FIFO_buff_size--;
        /* Update transmit ring FIFO tail pointer */
        uartcfg->rb.tx_tail++;
        if (uartcfg->rb.tx_tail >= UART_RING_BUFSIZE)
        {
            uartcfg->rb.tx_tail = 0;
        }
    } 

    /* If there is no more data to send, disable the transmit
       interrupt - else enable it or keep it enabled */
    if (uartcfg->rb.tx_head == uartcfg->rb.tx_tail)
    {
        uartregs->DMIER &= ~UART_IER_THRE;
    }
    else
    {
        uartregs->DMIER |= UART_IER_THRE;
    }
}

/**********************************************************************
 * Function: uart_standard_interrupt
 * Purpose: Common UART interrupt function
 * Parameter:
 * 		uartcfg: pointer to UART configuration structure
 * Return: 
 * 		None
 *********************************************************************/
STATIC void uart_standard_interrupt(UART_CFG_T *uartcfg)
{	
	UART_Type *uartregs = uartcfg->regptr;
    U32 iir_temp = uartregs->IIFCR;
    /* Skip Pending bit and mask bits 3..1 for checking */
    iir_temp &= 0x0E;
    
    /* Interrupt was due to a receive data FIFO service request */
    if ((iir_temp == UART_IIR_RDA) || (iir_temp == UART_IIR_CTI))
    /* if (iir_temp == UART_IIR_RDA)
     * HieuNguyen: remain for spurious interrupt handling
     * causes by CTI interrupt... */
    {
    	uart_standard_receive(uartcfg);
    }
    
    /* Interrupt was due to a transmit data FIFO service request */
    /* Check interrupt pending and THRE bit */
    if (iir_temp == UART_IIR_THRE)
    {	
    	uart_standard_transmit(uartcfg);
    }
    
    /* Interrupt was due to receive line status */
    if (iir_temp == UART_IIR_RLS)
    {
    	/* Add your code here */
    }
    
