iarsystems/ewarm-nxp-example-projects/LPC_CDL/software/csps/lpc23xx/source/lpc23xx_uart_driver.c
    /* Interrupt was due to a modem service request */
    /* 
    if ((uartregs->iifcr & UART_INTR_MI) != 0)
    {
         Nothing to do here - add functionality as needed. For now,
           just disable the interrupt so it won't happen again 
        uartregs->inte &= ~UART_INTR_MI;
    }
    */
}

/**********************************************************************
 * Function: uart_get_free_tx_count
 * Purpose: Return the amount of free space in the transmit ring buffer
 * Parameter:
 * 		uartcfg: pointer to UART configuration structure
 * Return: 
 * 		The number of free bytes in the transmit ring buffer
 *********************************************************************/
STATIC S32 uart_get_free_tx_count(UART_CFG_T *uartcfg)
{
    S32 count = 0;

    count = uartcfg->rb.tx_head - uartcfg->rb.tx_tail;
    if (count < 0)
    {
        /* head pointer has flipped to start of ring */
        count = (UART_RING_BUFSIZE - uartcfg->rb.tx_tail) +
            uartcfg->rb.tx_head;
    }

    return (UART_RING_BUFSIZE - count - 1);
}



/**********************************************************************
 * UART driver public functions
 *********************************************************************/

/**********************************************************************
 * Function: UART_Init
 * Purpose: Open a UART
 * Parameter:
 * 		UARTPortNum: UART port number (0, 1, 2, 3)
 * 		Baudrate: Baudrate value 
 * 		Databit: Databit value
 * 		Parity: Parity value
 * 		Stopbit: Stopbit value
 * Return: 
 * 		The pointer to a UART config structure or 0
 *********************************************************************/
S32 UART_Init (S32 UARTPortNum, U32 Baudrate, U32 Databit, 
				U32 Parity, U32 Stopbit)
{
    UART_CFG_T *uartcfg;

    /* Invalid or disabled UART */
    uartcfg = (UART_CFG_T *) NULL;

#if UART_0_ENABLE == 1
    if (UARTPortNum == UART_PORT_0)
    {
        /* UART 0 selected */
        uartcfg = &uart0cfg;
    }
#endif

#if UART_1_ENABLE == 1
    if (UARTPortNum == UART_PORT_1)
    {
        /* UART 0 selected */
        uartcfg = &uart1cfg;
    }
#endif

    if (uartcfg != (UART_CFG_T *) NULL)
    {
        /* Valid UART selected, has it been previously initialized? */
        if (uartcfg->init == FALSE)
        {
            /* Device not initialized and it is usable, so set it to
               used */
            uartcfg->init = TRUE;

            /* Save address of register block */
            switch (UARTPortNum)
            {
            /* UART 0 selected */
            case UART_PORT_0:
            	uartcfg->regptr = UART0;
            	
                /* Enable UART function pin */
                PINSEL_Set(PORT_0, 2, FUNC_1);
                PINSEL_Set(PORT_0, 3, FUNC_1);
                
                /* Set up clock and power for UART module */
            	SCB_EnablePPWR (PCUART0);
                /* As default, peripheral clock for UART0 module 
                 * is set to FCCLK / 2 */
            	SCB_SetPCLKDiv(PCLK_UART0, CCLK_DIV_2);
            	
            	break;
            	
        	/* UART 1 selected */
            case UART_PORT_1:
            	uartcfg->regptr = UART1;
            	
                /* Enable UART function pin */
                PINSEL_Set(PORT_0, 15, FUNC_1);
                PINSEL_Set(PORT_0, 16, FUNC_1);
                
                /* Set up clock and power for UART module */
            	SCB_EnablePPWR (PCUART1);
                /* As default, peripheral clock for UART1 module 
                 * is set to FCCLK / 2 */
            	SCB_SetPCLKDiv(PCLK_UART1, CCLK_DIV_2);
            	
            	break;
            }
            
            /* Disable interrupts - the interrupts remain off until
                they are enabled */
            /* DLAB bit (lcr) must be reset */
            uartcfg->regptr->LCR = 0;
            uartcfg->regptr->DMIER = 0;

            /* Initialize the ring buffers */
            uartcfg->rb.tx_head = uartcfg->rb.tx_tail = 0;
            uartcfg->rb.rx_head = uartcfg->rb.rx_tail = 0;            
            
            UART_SetBaudrate ((S32) uartcfg, Baudrate);
            UART_SetDatabit ((S32) uartcfg, Databit);
            UART_SetParity ((S32) uartcfg, Parity);
            UART_SetStopbit ((S32) uartcfg, Stopbit);
 
            /* FIFOs are empty when it is re-enabled - 
             * FIFO length = 1 as default */
            uartcfg->regptr->IIFCR = (U32)( UART_FIFO_EN | 
            		UART_FIFO_RX_RS | UART_FIFO_TX_RS);
            
            /* Enable transmit bit */
            uartcfg->regptr->TER = UART_TER_TXEN;
        }
    }

    return (S32) uartcfg;
}

/**********************************************************************
 * Function: UART_SetBaudrate
 * Purpose: Set baurate for UART device
 * Parameter:
 * 		UARTdev: pointer to UART configuration structure
 * 		Baudrate: Baudrate value
 * Return: 
 * 		None
 *********************************************************************/
void UART_SetBaudrate (S32 UARTdev, U32 Baudrate)
{
	UART_CFG_T *uartcfg = (UART_CFG_T *) UARTdev;
	
	S32 temp, div, mul, udl1, udl1m, udl2, udls, last_udl, last_div, last_mul;
	float clock, baud, udl0, baud1, baud2, err1, err2, errs, last_err;
	U32 udll, udlm;
	
	if (uartcfg->init == FALSE)
	{
		return;
	}
	
	if (uartcfg->regptr == UART0)
	{
		clock = (float) SCB_GetPCLK (PCLK_UART0);
	}
	else if (uartcfg->regptr == UART1)
	{
		clock = (float) SCB_GetPCLK (PCLK_UART1);
	}
	
	baud = (float) Baudrate;
	div = 0;
	mul = 0;
	udl1 = 0;
	udl1m = 0;
	udl2 = 0;
	udls = 0;
	last_udl = 0;
	last_div = 0;
	last_mul = 0;
	
	udl0 = 0;
	baud1 = 0;
	baud2 = 0;
	err1 = 0;
	err2 = 0;
	errs = 0;
	last_err = 1000;
	
	for (div = 0; div < 15; div++)
	{		
		for (mul = div + 1; mul < 16; mul++)
		{
			udl0 = (float)clock / (float)(16 * baud * (1 + ((float)div / (float)mul)));
			temp = (S32) udl0;			
			
			if (temp == 0)
			{
				udl1 = 1;
			}
			else
			{
				udl1 = temp;
			}
			
			if (udl1 > 65535)
			{
				udl1m = 65535;
			}
			else
			{
				udl1m = udl1;
			}
			
			if ((udl0 == udl1) || (udl1m == 65535))
			{
				udl2 = udl1m;
			}
			else
			{
				udl2 = temp + 1;
			}
			
