iarsystems/ewarm-nxp-example-projects/LPC_CDL/software/csps/lpc23xx/source/lpc23xx_uart_driver.c
			baud1 = (float)clock / (float)(16 * udl1m * (1 + ((float)div / (float)mul)));
			err1 =  (((float)baud1 / (float)baud) - 1);
			
			if (err1 < 0)
			{
				err1 = -err1;
			}
			
			baud2 = (float)clock / (float)(16 * udl2 * (1 + ((float)div / (float)mul)));
			err2 = (((float)baud2 / (float)baud) - 1);
			
			if (err2 < 0)
			{
				err2 = -err2;
			}
			
			if (err1 < err2)
			{
				errs = err1;
				udls = udl1;
			}
			else
			{
				errs = err2;
				udls = udl2;  
			}
			if (errs < last_err)
			{
				last_err = errs;
				last_udl = udls;
				last_div = div;
				last_mul = mul;
			}
		}		
	}
	
	udlm = (U32) (last_udl / 256);
	udll = (U32) (last_udl - (256 * udlm));
	
	uartcfg->regptr->LCR |= UART_LCR_DLABEN;
	uartcfg->regptr->DMIER = udlm;							
	uartcfg->regptr->RBTHDLR = udll;
    /* Then reset DLAB bit */
	uartcfg->regptr->LCR&= ~UART_LCR_DLABEN;
	uartcfg->regptr->FDR = (U32)(((U32) last_mul << 4) | ((U32) last_div));
}

/**********************************************************************
 * Function: UART_SetDatabit
 * Purpose: Set databit for UART device
 * Parameter:
 * 		UARTdev: pointer to UART configuration structure
 * 		Databit: Databit value
 * Return: 
 * 		None
 *********************************************************************/
void UART_SetDatabit (S32 UARTdev, U32 Databit)
{
	UART_CFG_T *uartcfg = (UART_CFG_T *) UARTdev;
	U32 tmp1;
	
	if (uartcfg->init == FALSE)
	{
		return;
	}
	
	/* Set the data bit width */            	
	if ((Databit >= 5) && (Databit <= 8))
	{
	    tmp1 = uartcfg->regptr->LCR & ~UART_LCR_WLEN8;
	    switch (Databit)
	    {
    	case 5: uartcfg->regptr->LCR = 
    			(tmp1 | UART_LCR_WLEN5);
    			break;
    	case 6: uartcfg->regptr->LCR =
				(tmp1 | UART_LCR_WLEN6);
				break;
    	case 7: uartcfg->regptr->LCR = 
    			(tmp1 | UART_LCR_WLEN7);
    			break;
    	case 8: uartcfg->regptr->LCR = 
				(tmp1 | UART_LCR_WLEN8);
				break;
	    }
	}
	
	return;
}

/**********************************************************************
 * Function: UART_SetParity
 * Purpose: Set parity for UART device
 * Parameter:
 * 		UARTdev: pointer to UART configuration structure
 * 		Parity: Parity value
 * Return: 
 * 		None
 *********************************************************************/
void UART_SetParity (S32 UARTdev, U32 Parity)
{
	UART_CFG_T *uartcfg = (UART_CFG_T *) UARTdev;
	U32 tmp1 = 0;
	
	if (uartcfg->init == FALSE)
	{
		return;
	}
	
    switch (Parity)
    {
        case PARITY_NONE:
            /* Disable parity */
            uartcfg->regptr->LCR &= ~UART_LCR_PEN;
            break;

        case PARITY_ODD:
            /* Odd parity */
        	uartcfg->regptr->LCR |= UART_LCR_PEN;
            tmp1 = uartcfg->regptr->LCR & ~UART_LCR_SP_0;
            uartcfg->regptr->LCR =  tmp1 | UART_LCR_PODD;
            break;

        case PARITY_EVEN:
            /* Even parity */
        	uartcfg->regptr->LCR |= UART_LCR_PEN;
            tmp1 = uartcfg->regptr->LCR & ~UART_LCR_SP_0;
            uartcfg->regptr->LCR =  tmp1 | UART_LCR_PEVEN;
            break;
            
        case PARITY_SP_1:
            /* Forced "1" stick parity */
        	uartcfg->regptr->LCR |= UART_LCR_PEN;
            tmp1 = uartcfg->regptr->LCR & ~UART_LCR_SP_0;
            uartcfg->regptr->LCR =  tmp1 | UART_LCR_SP_1;
            break;
        
        case PARITY_SP_0:
            /* Forced "0" stick parity */
        	uartcfg->regptr->LCR |= UART_LCR_PEN;
        	uartcfg->regptr->LCR |= UART_LCR_SP_0;
            break;
    }
    
    return;
}

/**********************************************************************
 * Function: UART_SetStopbit
 * Purpose: Set stopbit for UART device
 * Parameter:
 * 		UARTdev: pointer to UART configuration structure
 * 		Stopbit: Stopbit value
 * Return: 
 * 		None
 *********************************************************************/
void UART_SetStopbit (S32 UARTdev, U32 Stopbit)
{
	UART_CFG_T *uartcfg = (UART_CFG_T *) UARTdev;
	
	if (uartcfg->init == FALSE)
	{
		return;
	}
	
    /* Set the number of stop bits */
    if (Stopbit == 1)
    {
        /* 1 stop bit */
    	uartcfg->regptr->LCR &= ~UART_LCR_STP2;
    }
    else if (Stopbit == 2)
    {
        /* 2 stop bits */
        uartcfg->regptr->LCR |= UART_LCR_STP2;
    }
}

/**********************************************************************
 * Function: UART_SetFIFO
 * Purpose: Set Rx FIFO trigger level for UART device
 * Parameter:
 * 		UARTdev: pointer to UART configuration structure
 * 		FIFOlevel: Rx FIFO trigger level value
 * Return: 
 * 		None
 *********************************************************************/
void UART_SetFIFO (S32 UARTdev, U32 FIFOlevel)
{
	UART_CFG_T *uartcfg = (UART_CFG_T *) UARTdev;
	
	if (uartcfg->init == FALSE)
	{
		return;
	}
	
	/* This argument used for disable FIFO */
	if (FIFOlevel == 4)
	{
        /* Disable FIFOs */
		uartcfg->regptr->IIFCR &= ~UART_FIFO_EN;
	}
	/* Enable FIFO with FIFO level */
	else
	{
		switch (FIFOlevel)
		{
		/* 1 character */
		case 0:
			uartcfg->regptr->IIFCR |= UART_FIFO_TRG_LEV0;
			break;
		/* 4 character */
		case 1:
			uartcfg->regptr->IIFCR |= UART_FIFO_TRG_LEV1;
			break;
		/* 8 character */
		case 2:
			uartcfg->regptr->IIFCR |= UART_FIFO_TRG_LEV2;
			break;
		/* 14 character */
		case 3:
			uartcfg->regptr->IIFCR |= UART_FIFO_TRG_LEV3;
			break;	
		}
		
        /* Enable FIFOs */
        uartcfg->regptr->IIFCR |= UART_FIFO_EN;
	}
}

/**********************************************************************
 * Function: UART_EnableInt
 * Purpose: Enable interrupt for each type for UART device 
 * Parameter:
 * 		UARTdev: pointer to UART configuration structure
 * 		UARTIntType: Type of UART interrupt
 * Return: 
 * 		None
 *********************************************************************/
void UART_EnableInt (S32 UARTdev, U32 UARTIntType)
{
	UART_CFG_T *uartcfg = (UART_CFG_T *) UARTdev;
	
