iarsystems/ewarm-nxp-example-projects/LPC_CDL/software/csps/lpc23xx/source/lpc23xx_uart_driver.c
    /* Enable selected interrupts */            	
	uartcfg->regptr->DMIER |= ((U32) UARTIntType & 
     		(UART_IER_RBR | UART_IER_THRE | UART_IER_RLS)); 
}

/**********************************************************************
 * Function: UART_DisableInt
 * Purpose: Disable interrupt for each type for UART device 
 * Parameter:
 * 		UARTdev: pointer to UART configuration structure
 * 		UARTIntType: Type of UART interrupt
 * Return: 
 * 		None
 *********************************************************************/
void UART_DisableInt (S32 UARTdev, U32 UARTIntType)
{
	UART_CFG_T *uartcfg = (UART_CFG_T *) UARTdev;
	
	/* Disable selected interrupts */  
	uartcfg->regptr->DMIER &= ~((U32) UARTIntType & 
    		(UART_IER_RBR | UART_IER_THRE | UART_IER_RLS));      
}

/**********************************************************************
 * Function: UART_GetStatus
 * Purpose: Get current status of UART line status register 
 * Parameter:
 * 		UARTdev: pointer to UART configuration structure
 * Return: 
 * 		Value of UART status register 
 *********************************************************************/
U32 UART_GetStatus (S32 UARTdev)
{
	UART_CFG_T *uartcfg = (UART_CFG_T *) UARTdev;
	
	if (uartcfg->init == FALSE) return 0;
	return uartcfg->regptr->LSR;
}

/**********************************************************************
 * Function: UART_Close
 * Purpose: Close the UART device
 * Parameter:
 * 		UARTdev: pointer to UART configuration structure
 * Return: 
 * 		_NO_ERROR if success or _ERROR
 *********************************************************************/
S32 UART_Close (S32 UARTdev)
{
    UART_CFG_T *uartcfgptr = (UART_CFG_T *) UARTdev;
    STATUS status = _ERROR;

    if (uartcfgptr->init == TRUE)
    {
        /* Disable UART */
        /* Do nothing since UART has not UART ENABLE bit */
        status = _NO_ERROR;
        uartcfgptr->init = FALSE;
    }

    return status;
}

/**********************************************************************
 * Function: UART_ReadPoll
 * Purpose: UART read function for polled mode
 * Parameter:
 * 	   UARTdev: Pointer to UART config structure
 *     buffer: Pointer to data buffer to copy to
 *     max_bytes: Number of bytes to read
 * Return: 
 * 		Number of bytes actually read from the FIFO
 *********************************************************************/
S32 UART_ReadPoll (S32 UARTdev,
                        void *buffer,
                        S32 max_bytes)
{
    UART_Type *uartregs;
    UART_CFG_T *uartcfgptr = (UART_CFG_T *) UARTdev;
    U8 *data = (U8 *) buffer;
    S32 bytes = 0;

    if (uartcfgptr->init == TRUE)
    {
        uartregs = uartcfgptr->regptr;

        /* Loop until receive FIFO is empty or until max_bytes
           expires */
        while ((max_bytes > 0) && (uartregs->LSR & UART_LSR_RDR))
        {
            /* Read data from FIFO into buffer */
            *data = (U8) uartregs->RBTHDLR;
            data++;

            /* Increment data count and decrement buffer size count */
            bytes++;
            max_bytes--;
        }
    }

    return bytes;
}

/**********************************************************************
 * Function: UART_WritePoll
 * Purpose: UART write function for polled mode
 * Parameter:
 * 	   UARTdev: Pointer to UART config structure
 *     buffer:  Pointer to data buffer to copy from
 *     n_bytes: Number of bytes to write
 * Return: 
 * 		 Number of bytes actually written to the FIFO
 *********************************************************************/
S32 UART_WritePoll (S32 UARTdev,
                         void *buffer,
                         S32 n_bytes)
{
    UART_Type *uartregs;
    UART_CFG_T *uartcfgptr = (UART_CFG_T *) UARTdev;
    U8 *data = (U8 *) buffer;
    S32 bytes = 0;

    if (uartcfgptr->init == TRUE)
    {
        uartregs = uartcfgptr->regptr;

        /* Loop until n_bytes expires to 0 */
        while (n_bytes > 0)
        {
            if (uartregs->LSR & UART_LSR_THRE)
            {
                /* Write data from buffer into FIFO */
                uartregs->RBTHDLR = *data;
                data++;

                /* Increment data count and decrement buffer size
                   count */
                bytes++;
                n_bytes--;
            }
        }
    }

    return bytes;
}

/**********************************************************************
 * Function: UART_ReadRing
 * Purpose: UART read function for interrupt mode (using ring buffers)
 * Parameter:
 * 	   UARTdev:  Pointer to UART config structure
 *     buffer:    Pointer to data buffer to copy to
 *     max_bytes: Number of bytes to read
 * Return: 
 * 		 Number of bytes actually read from the ring buffer
 *********************************************************************/
S32 UART_ReadRing (S32 UARTdev,
                      void *buffer,
                      S32 max_bytes)
{
    UART_Type *uartregs;
    U32 savedint;
    UART_CFG_T *uartcfgptr = (UART_CFG_T *) UARTdev;
    U8 *data = (U8 *) buffer;
    S32 bytes = 0;

    if (uartcfgptr->init == TRUE)
    {
        uartregs = uartcfgptr->regptr;
        
        /* Temporarily lock out UART receive interrupts during this
           read so the UART receive interrupt won't cause problems
           with the index values */ 
        savedint = uartregs->DMIER & (UART_IER_RBR | UART_IER_RLS);
        uartregs->DMIER &= ~(UART_IER_RBR | UART_IER_RLS);
        
        /* Loop until receive buffer ring is empty or 
        	until max_bytes expires */
        while ((max_bytes > 0) &&
            (uartcfgptr->rb.rx_tail != uartcfgptr->rb.rx_head))
        {
            /* Read data from ring buffer into user buffer */
            *data = uartcfgptr->rb.rx[uartcfgptr->rb.rx_tail];
            data++;

            /* Update tail pointer */
            uartcfgptr->rb.rx_tail++;

            /* Make sure tail didn't overflow */
            if (uartcfgptr->rb.rx_tail >= UART_RING_BUFSIZE)
            {
                uartcfgptr->rb.rx_tail = 0;
            }

            /* Increment data count and decrement buffer size count */
            bytes++;
            max_bytes--;
        }

        /* Re-enable UART interrupts */
        uartregs->DMIER |= savedint;
    }

