iarsystems/ewarm-nxp-example-projects/LPC_CDL/software/csps/lpc23xx/source/lpc23xx_uart_driver.c
    return bytes;
}

/**********************************************************************
 * Function: UART_WriteRing
 * Purpose: UART write function for interrupt mode (using ring buffers)
 * Parameter:
 * 	   UARTdev: Pointer to UART config structure
 *     buffer:  Pointer to data buffer to copy from
 *     n_bytes: Number of bytes to write
 * Return: 
 * 		 Number of bytes actually written to the ring buffer
 *********************************************************************/
S32 UART_WriteRing (S32 UARTdev,
                       void *buffer,
                       S32 n_bytes)
{
    UART_Type *uartregs;
    U32 savedint;
    UART_CFG_T *uartcfgptr = (UART_CFG_T *) UARTdev;
    U8 *data = (U8 *) buffer;
    S32 bytes = 0;

    if (uartcfgptr->init == TRUE)
    {
        uartregs = uartcfgptr->regptr;

        /* Temporarily lock out UART transmit interrupts during this
           read so the UART transmit interrupt won't cause problems
           with the index values */
        savedint = uartregs->DMIER & UART_IER_THRE;
        uartregs->DMIER &= ~UART_IER_THRE;
        
        /* Loop until transmit run buffer is full or until n_bytes
           expires */
        while ((n_bytes > 0) &&
            (uart_get_free_tx_count(uartcfgptr) > 0))
        {
            /* Write data from buffer into ring buffer */
            uartcfgptr->rb.tx[uartcfgptr->rb.tx_head] = *data;
            data++;

            /* Increment head pointer */
            uartcfgptr->rb.tx_head++;
            if (uartcfgptr->rb.tx_head >= UART_RING_BUFSIZE)
            {
                uartcfgptr->rb.tx_head = 0;
            }

            /* Increment data count and decrement buffer size count */
            bytes++;
            n_bytes--;
        }

        /* Now start sending the data - this will also re-enable the
           transmit interrupt */
        if (bytes > 0)
        {
            if (uartregs->LSR & UART_LSR_THRE)
            {
            	uart_standard_transmit(uartcfgptr);
            }
            else 
            {
            	uartregs->DMIER |= UART_IER_THRE;
            }
        }
        else
        {
        	/* Restore original interrupt state */
        	uartregs->DMIER |= savedint;
        }
    }
    return bytes;
}

#if UART_0_ENABLE == 1
/**********************************************************************
 * Function: uart0_isr
 * Purpose: UART 0 interrupt function
 * Parameter:
 * 	   	None
 * Return: 
 * 		None
 *********************************************************************/
void uart0_isr(void)
{
    uart_standard_interrupt(&uart0cfg);
    /* Update VIC Vector Addr */
    VIC_Ack();
}
#endif

#if UART_1_ENABLE == 1
/**********************************************************************
 * Function: uart1_isr
 * Purpose: UART 1 interrupt function
 * Parameter:
 * 	   	None
 * Return: 
 * 		None
 *********************************************************************/
void uart1_isr(void)
{
    uart_standard_interrupt(&uart1cfg);
    /* Update VIC Vector Addr */
    VIC_Ack();
}
#endif


/***********************************************************************
 * UART driver utilities
 **********************************************************************/

/********************************************************************
 * Function: UART_PutChar
 * Purpose: Put a character to UART port
 * Parameters: 
 * 		devid: Pointer to UART device
 * 		ch: character to send
 * Returns: 
 * 		Nothing
 *******************************************************************/
void UART_PutChar (S32 devid, CHAR ch)
{
	UART_Type *uartregs;
    UART_CFG_T *uartcfgptr = (UART_CFG_T *) devid;

    if (uartcfgptr->init == TRUE)
    {
        uartregs = uartcfgptr->regptr;
        while (!(uartregs->LSR & UART_LSR_THRE));
        uartregs->RBTHDLR = ch;
    }
}

/********************************************************************
 * Function: UART_Puts
 * Purpose: Put a string to UART port
 * Parameters: 
 * 		devid: Pointer to UART device
 * 		str: pointer to string to send
 * Returns: 
 * 		Nothing
 *******************************************************************/
void UART_Puts(S32 devid, const void *str)
{
	CHAR *s = (CHAR *) str;
	
	while (*s)
	{
		UART_PutChar(devid, *s++);
	}
}

/**********************************************************************
 * Function: UART_Puts_
 * Purpose: Put a string to UART port and print new line
 * Parameter:
 *		devid: Pointer to UART device
 * 		str: pointer to string to send
 * Return: 
 * 		None
 *********************************************************************/
void UART_Puts_(S32 devid, const void *str)
{
	UART_Puts (devid, str);
	UART_Puts (devid, "\n\r");
}

/**********************************************************************
 * Function: UART_PutDec
 * Purpose: Covert a decimal number (U64) to string and send to UART
 * Parameter:
 * 		devid: Pointer to UART device
 * 		decnum: U64 number 
 * Return: 
 * 		None
 *********************************************************************/
void UART_PutDec(S32 devid, U64 decnum)
{
	U64 tmp = 9, cnt = 1;
	
#if 1
	CHAR ch[21] = {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};
#endif
	
	while (tmp < decnum)
	{
		tmp *= 10;
		tmp += 9;
		cnt ++;
	}
	
#if 0
	CHAR ch[cnt + 1];
	ch[cnt] = 0;
#endif
	
	while (cnt--)
	{
		ch[cnt] = '0' + (decnum % 10);
		decnum /= 10;
	}
	
	UART_Puts (devid, ch);
}

/**********************************************************************
 * Function: UART_PutHex
 * Purpose: Covert a hex number (U32) to string and send to UART
 * Parameter:
 * 		devid: Pointer to UART device
 * 		hexnum: U32 hex number 
 * Return: 
 * 		None
 *********************************************************************/
void UART_PutHex (S32 devid, U32 hexnum) 
{
	U8 nibble;
	U8 i;
	
	UART_Puts (devid, "0x");
	
	i = 7;
	do
	{
		nibble = (hexnum >> (4 * i)) & 0x0F;
		if (nibble > 9) 
		{
			UART_PutChar(devid, 'A' + (nibble - 10));
		}
		else
		{
			UART_PutChar(devid, '0' +  nibble);
		}
	} while (i--);
}
